Конфигурация/DataProcessors/ИмпортПроцентныхПоказателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>ИмпортПроцентныхПоказателей</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Конфигурация/InformationRegisters/СредневзвешенныеПроцентныеСтавки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СредневзвешенныеПроцентныеСтавки</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПроцентнаяСтавка</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПроцентнаяСтавка</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НачалоРасчетногоМесяца</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСредневзвешенныхСтавок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаБанков</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ГруппыБанковДляПолученияРыночнойПроцентнойСтавки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидШкалы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыШкалСредневзвешенныхПроцентныхСтавковПоДепозитам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИнтервалШкалы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИнтервалыШкалСредневзвешенныхПроцентныхСтавокПоДепозитам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/СтатистикаРаботыВнутреннихМеханизмов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СтатистикаРаботыВнутреннихМеханизмов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПериодВыполненияНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодВыполненияОкончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодВыполненияНачалоМС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодВыполненияОкончаниеМС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПараметрыВыполнения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сеанс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СессияЗавершенаСОшибкой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Механизм</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сессия</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачалаВыполнения</Name>
					<Comment>Должна соответствовать дате из ПериодВыполненияНачало. Служит для групповой обработки записей</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/ВидыСредневзвешенныхСтавок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыСредневзвешенныхСтавок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоДепозитамНФО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоДепозитамФизЛиц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоКредитамНФО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоКредитамФизЛиц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоКредитамМСП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/ИнтервалыШкалСредневзвешенныхПроцентныхСтавокПоДепозитам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ИнтервалыШкалСредневзвешенныхПроцентныхСтавокПоДепозитам</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДоВостребования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>До30ДнейВключаяДоВостребования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>До30ДнейКромеДоВостребования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>От31До90Дней</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>От91До180Дней</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>От181ДняДо1Года</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>До1ГодаВключаяДоВостребования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>До1ГодаКромеДоВостребования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>От1ГодаДо3Лет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Свыше1Года</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Свыше3Лет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/ВидыШкалСредневзвешенныхПроцентныхСтавковПоДепозитам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыШкалСредневзвешенныхПроцентныхСтавковПоДепозитам</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Свернутая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Развернутая</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/ВидыПроцентныхПоказателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыПроцентныхПоказателей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КлючеваяСтавкаЦБРФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИПЦкДекабрюПредыдущегоГода</Name>
					<Comment>Индекс инфляции, CPI</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИПЦкКонцуПредыдущегоМесяца</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РостВВП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПремияЗаСубординированность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИПЦкСоответствующемуМесяцуПредыдущегоГода</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Catalogs/Оповещения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Оповещения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСобытий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатели</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТекста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыТекстовЭлектронныхПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПисьмоВФорматеHTML</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстПисьмаВФорматеHTML</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартинкиПисьмаВФорматеHTML</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнятьСписокПолучателейИзИсточника</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСравнения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыСравнений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ВсеТипы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СписокЗначений</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Источники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПолноеИмяИсточника</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/DataProcessors/ИмпортПроцентныхПоказателей/Ext/ObjectModule.bsl
Перем Ошибки;					// Ошибки, регистрируются только при выполнении регламентной команды
Перем Исключения;				// Исключительные ситуации, которые важно регистрировать всегда
Перем ИсточникВызоваКоманды;	// Заполняется при выполнении команды внешней обработки

Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыОбработки) Экспорт
	
	ИсточникВызоваКоманды = ПараметрыОбработки.ДополнительнаяОбработкаСсылка;
	
	ЭтотОбъект.ДатаЗагрузки = ТекущаяДата();
	
	ОтчетОбИзменениях = Неопределено;
	
	Если ИдентификаторКоманды = "ИмпортСредневзвешенныхПроцентныхСтавок" Тогда
		ОтчетОбИзменениях = ИмпортСредневзвешенныхПроцентныхСтавок();
	ИначеЕсли ИдентификаторКоманды = "ИмпортИндексовПотребительскихЦен" Тогда
		ИмпортИндексовПотребительскихЦен();
	ИначеЕсли ИдентификаторКоманды = "ИмпортПрогнозныхЗначенийОтНИУВШЭ" Тогда
		ИмпортПрогнозныхЗначенийОтНИУВШЭ();
	КонецЕсли;
	
	Если ОтчетОбИзменениях <> Неопределено Тогда
		
		#Область Формируем_оповещение_об_изменениях
		
		РеквизитыОповещения = Новый Структура;
		РеквизитыОповещения.Вставить("ДатаЗагрузки",		Формат(ЭтотОбъект.ДатаЗагрузки, "ДФ=dd.MM.yyyy"));
		РеквизитыОповещения.Вставить("ОтчетОбИзменениях",	РаботаСОтчетами.ТабличныйДокументВHTML(ОтчетОбИзменениях));
		
		Оповещение = Новый Структура;
		Оповещение.Вставить("ПолноеИмяИсточника",	ЭтотОбъект.Метаданные().ПолноеИмя() + "." + ИдентификаторКоманды + ".ОтчетОбИзменениях");
		Оповещение.Вставить("ТипСобытия",			Перечисления.ТипыСобытий.ВнешнийВызов);
		Оповещение.Вставить("РеквизитыОповещения",	РеквизитыОповещения);
		
		МассивСообщенийПользователю = ОбщегоНазначения.ОчиститьБуферСообщенийПользователю();
		
		Попытка
			Справочники.Оповещения.СформироватьОповещения(Оповещение.ПолноеИмяИсточника, Оповещение.ТипСобытия, Оповещение.РеквизитыОповещения);
		Исключение
			ОбщегоНазначения.ОбработатьИсключение(СтрШаблон("Ошибка выполнения оповещения '%1'.", Оповещение.ПолноеИмяИсточника), ИнформацияОбОшибке(), ИсточникВызоваКоманды, Ложь);
		КонецПопытки;
		
		ОбщегоНазначения.ВосстановитьСообщенияПользователю(МассивСообщенийПользователю);

		#КонецОбласти

	КонецЕсли;
	
КонецПроцедуры

#Область Импорт_средневзвешенных_процентных_ставок

Функция ИмпортСредневзвешенныхПроцентныхСтавок() Экспорт
	
	СессияСбораСтатистики = ЗарегистрироватьНачалоСессии("ИмпортСредневзвешенныхПроцентныхСтавок");
	
	ТаблицаФайлов = РаботаСВнешнимиСистемами.ПодготовитьТаблицуСохраненияФайловВExternals();
	ТаблицаФайлов.Колонки.Добавить("ПолноеИмяФайла", Новый ОписаниеТипов("Строка"));
	ТаблицаФайлов.Колонки.Добавить("АдресИсточника", Новый ОписаниеТипов("Строка"));
	ТаблицаФайлов.Колонки.Добавить("Сохранить",		 Новый ОписаниеТипов("Булево"));
	
	ОтчетОбИзменениях = Неопределено;
	
	Для Каждого ВидПроцентныхПоказателей Из Перечисления.ВидыСредневзвешенныхСтавок Цикл
		Для Каждого ГруппаБанков Из Перечисления.ГруппыБанковДляПолученияРыночнойПроцентнойСтавки Цикл
			ЗагрузитьСредневзвешенныеПроцентныеСтавки(ТаблицаФайлов, ВидПроцентныхПоказателей, ГруппаБанков, ОтчетОбИзменениях);
		КонецЦикла;
	КонецЦикла;
	
	#Область Отправка_данных_в_Externals
	
	ОшибкаСинхронизации		  = Ложь;
	МассивОшибокСинхронизации = Новый Массив;
	
	ДопПараметрыСоединения = Новый Структура("РежимБезУведомлений, Ошибки", Истина, МассивОшибокСинхронизации);
	СтрокаСоединения	   = РаботаСВнешнимиСистемами.СтрокаСоединенияСExternals();
	Соединение			   = РаботаСВнешнимиСистемами.ADODBC_УстановитьСоединение(СтрокаСоединения, , ДопПараметрыСоединения);
	ADODBC_Константы	   = РаботаСВнешнимиСистемами.ADODBC_ВнутренниеКонстанты();
	
	Если Соединение = Неопределено Тогда
		ОшибкаСинхронизации = Истина;
	Иначе
	
		// Сохраним нужные файлы
		
		ТаблицаФайловДляСохранения = ТаблицаФайлов.Скопировать(Новый Структура("Сохранить", Истина));
		
		Если ТаблицаФайловДляСохранения.Количество() > 0 Тогда
			РаботаСВнешнимиСистемами.СохранитьМассивФайловВExternals(ТаблицаФайловДляСохранения, Соединение);
		КонецЕсли;
		
		// Выполним синхронизацию с таблицей:
		// создадим временную таблицу в Externals, заполним ее данными регистра и выполним merge с целевой таблицей Externals
		// N.B.: так делать нежелательно, т.к. заполнение таблицы через ADO (методом AddNew) выполняется очень медленно. 
		// #Техдолг
		
		СтартСинхронизации = ТекущаяУниверсальнаяДатаВМиллисекундах();
		
		ТекстЗапроса =
			"CREATE TABLE #CBR_Average_Interest_Rate (
			|	[Period] [date] NOT NULL,
			|	[Month] [date] NOT NULL,
			|	[Type] [varchar](20) NOT NULL,
			|	[Group_of_Banks] [varchar](20) NOT NULL,
			|	[Scale_Type] [varchar](15) NOT NULL,
			|	[Scale] [varchar](40) NOT NULL,
			|	[Currency_Code] [varchar](3) NOT NULL,
			|	[Rate] [float] NOT NULL,
			|	[Active] [bit] NOT NULL
			|)";

		Попытка
			Соединение.Execute(ТекстЗапроса, , ADODBC_Константы.adExecuteNoRecords);
		Исключение
			ОшибкаСинхронизации = Истина;
			МассивОшибокСинхронизации.Добавить(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
		Если Не ОшибкаСинхронизации Тогда
			
			#Область Запоминаем_коды_валют
			
			КодыВалют = Новый Соответствие;
			
			ВыборкаВалют = Справочники.Валюты.Выбрать();
			Пока ВыборкаВалют.Следующий() Цикл
				КодыВалют.Вставить(ВыборкаВалют.Ссылка, СокрЛП(ВыборкаВалют.Наименование));
			КонецЦикла;
			
			#КонецОбласти
			
			Попытка
				Recordset = Новый COMОбъект("ADODB.Recordset");
				Recordset.CursorType = ADODBC_Константы.adOpenKeyset;
				Recordset.LockType	 = ADODBC_Константы.adLockOptimistic;
				Recordset.Open("#CBR_Average_Interest_Rate", Соединение, , , ADODBC_Константы.adCmdTable);	
			Исключение
				ОшибкаСинхронизации = Истина;
				МассивОшибокСинхронизации.Добавить(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			КонецПопытки;
			
			Если Не ОшибкаСинхронизации Тогда
				
				ВыборкаЗаписейРегистра = РегистрыСведений.СредневзвешенныеПроцентныеСтавки.Выбрать();
				Пока ВыборкаЗаписейРегистра.Следующий() Цикл
					
					Recordset.AddNew();
					RecordSet.Fields("Period").Value			= ВыборкаЗаписейРегистра.Период;
					RecordSet.Fields("Month").Value				= ВыборкаЗаписейРегистра.НачалоРасчетногоМесяца;
					RecordSet.Fields("Type").Value				= РаботаСМетаданнымиПовтИсп.ПолучитьИдентификаторПеречисления(ВыборкаЗаписейРегистра.Вид);
					RecordSet.Fields("Group_of_Banks").Value 	= РаботаСМетаданнымиПовтИсп.ПолучитьИдентификаторПеречисления(ВыборкаЗаписейРегистра.ГруппаБанков);
					RecordSet.Fields("Scale_Type").Value		= РаботаСМетаданнымиПовтИсп.ПолучитьИдентификаторПеречисления(ВыборкаЗаписейРегистра.ВидШкалы);
					RecordSet.Fields("Scale").Value				= РаботаСМетаданнымиПовтИсп.ПолучитьИдентификаторПеречисления(ВыборкаЗаписейРегистра.ИнтервалШкалы);
					RecordSet.Fields("Currency_Code").Value		= КодыВалют[ВыборкаЗаписейРегистра.Валюта];
					RecordSet.Fields("Rate").Value				= ВыборкаЗаписейРегистра.ПроцентнаяСтавка;
					RecordSet.Fields("Active").Value			= ВыборкаЗаписейРегистра.Действует;
					
				КонецЦикла;
				
				Попытка
					Recordset.Update();
				Исключение
					ОшибкаСинхронизации = Истина;
					МассивОшибокСинхронизации.Добавить(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				КонецПопытки;
				
				Если Не ОшибкаСинхронизации Тогда
					
					ТекстЗапроса =
						"MERGE Externals.dbo.CBR_Average_Interest_Rates AS T
						|USING #CBR_Average_Interest_Rate AS S
						|ON T.Period = S.Period
						|	AND T.Month = S.Month
						|	AND T.Type = S.Type
						|	AND T.Group_of_Banks = S.Group_of_Banks
						|	AND T.Scale_Type = S.Scale_Type
						|	AND T.Scale = S.Scale
						|	AND T.Currency_Code = S.Currency_Code
						|WHEN NOT MATCHED BY TARGET
						|	THEN INSERT (Period, Month, Type, Group_of_Banks, Scale_Type, Scale, Currency_Code, Rate, Active)
						|		VALUES (S.Period, S.Month, S.Type, S.Group_of_Banks, S.Scale_Type, S.Scale, S.Currency_Code, S.Rate, S.Active)
						|WHEN NOT MATCHED BY SOURCE
						|	THEN DELETE
						|WHEN MATCHED AND (T.Rate <> S.Rate OR T.Active <> S.Active)
						|	THEN UPDATE SET T.Rate = S.Rate, T.Active = S.Active
						|;";
					
					НаборЗаписей = РаботаСВнешнимиСистемами.ADODBC_ВыполнитьЗапрос(Соединение, ТекстЗапроса, ДопПараметрыСоединения);
					
					Если НаборЗаписей = Неопределено Тогда
						ОшибкаСинхронизации = Истина;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		РаботаСВнешнимиСистемами.ADODBC_ЗакрытьСоединение(Соединение, ДопПараметрыСоединения);
		
		СессияСбораСтатистики.СтатистикаВыполнения.Добавить(СтрШаблон("Синхронизация с Externals: %1 мс.", ТекущаяУниверсальнаяДатаВМиллисекундах() - СтартСинхронизации));
		
	КонецЕсли;
		
	Если ОшибкаСинхронизации Тогда
		
		ТекстИсключения =
			"Не удалось выполнить синхронизацию данных о средневзешенных процентных ставках с БД Externals.
			|Система сообщает:
			|" + СтрСоединить(МассивОшибокСинхронизации, Символы.ПС + Символы.ПС);
		
		ДобавитьОшибку(ТекстИсключения, Исключения);
		
	КонецЕсли;
	
	#КонецОбласти
	
	ЗарегистрироватьОшибки();
	
	ЗарегистрироватьОкончаниеСессии(СессияСбораСтатистики);
	
	Возврат ОтчетОбИзменениях;
	
КонецФункции

Процедура ЗагрузитьСредневзвешенныеПроцентныеСтавки(ТаблицаФайлов, ВидПроцентныхПоказателей, ГруппаБанков, ОтчетОбИзменениях)
	
	Файл = СкачатьФайл(ТаблицаФайлов, ВидПроцентныхПоказателей, ГруппаБанков);
	
	Если Файл <> Неопределено Тогда
		
		ТаблицаСредневзвешенныхПроцентныхСтавок = ПолучитьСтруктуруРегистра("СредневзвешенныеПроцентныеСтавки");
		
		ЗаполненоУспешно = ЗаполнитьТаблицуСредневзвешенныхПроцентныхСтавокПоВкладам(Файл, ТаблицаСредневзвешенныхПроцентныхСтавок, ВидПроцентныхПоказателей, ГруппаБанков);	
		
		Если ЗаполненоУспешно Тогда
		
			ЕстьИзменения = ЗаписатьИзмененияСредневзвешенныхПроцентныхСтавок(Файл, ТаблицаСредневзвешенныхПроцентныхСтавок, ВидПроцентныхПоказателей, ГруппаБанков, ОтчетОбИзменениях);
			
			Если ТаблицаСредневзвешенныхПроцентныхСтавок.Количество() > 0 И ЕстьИзменения И ИсточникВызоваКоманды = Неопределено Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Загружены ставки '" + ВидПроцентныхПоказателей + "' по группе банков '" + ГруппаБанков + "'", ЭтотОбъект);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры	

Функция ЗаписатьИзмененияСредневзвешенныхПроцентныхСтавок(Файл, ТаблицаСредневзвешенныхПроцентныхСтавок, ВидПроцентныхПоказателей, ГруппаБанков, ОтчетОбИзменениях)
	
	// Сверка однородных данных
	
	ТекстЗапросаДанныхУчетнойСистемы =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СредневзвешенныеПроцентныеСтавки.*
		|ИЗ
		|	РегистрСведений.СредневзвешенныеПроцентныеСтавки.СрезПоследних(
		|			&ДатаЗагрузки,
		|			Вид = &ВидПроцентныхПоказателей
		|				И ГруппаБанков = &ГруппаБанков
		|				И (НачалоРасчетногоМесяца, Валюта) В (&СверяемыеРасчетныеМесяцы)) КАК СредневзвешенныеПроцентныеСтавки
		|ГДЕ
		|	СредневзвешенныеПроцентныеСтавки.Действует";
	
	ОписаниеНабора = Новый Структура;
	ОписаниеНабора.Вставить("КлючевыеПоля",						 "НачалоРасчетногоМесяца, Вид, ГруппаБанков, ВидШкалы, ИнтервалШкалы, Валюта");
	ОписаниеНабора.Вставить("Ресурсы",							 "ПроцентнаяСтавка");
	ОписаниеНабора.Вставить("ДанныеВнешнейСистемы",				 ТаблицаСредневзвешенныхПроцентныхСтавок.Скопировать(Новый Структура("Действует", Истина))); // Недействующие записи теперь не нужны
	ОписаниеНабора.Вставить("ДанныеУчетнойСистемы",				 ТекстЗапросаДанныхУчетнойСистемы);
	ОписаниеНабора.Вставить("ГруппироватьЗаписиПоКлючевымПолям", Ложь);

	НаборыДанных = Новый Массив;
	НаборыДанных.Добавить(ОписаниеНабора);
			
	Заголовки = Новый Структура;
	Заголовки.Вставить("НачалоРасчетногоМесяца", "Начало расчетного месяца");
	Заголовки.Вставить("ГруппаБанков",			 "Группа банков");
	Заголовки.Вставить("ВидШкалы",				 "Вид шкалы");
	Заголовки.Вставить("ИнтервалШкалы",			 "Интервал шкалы");
	Заголовки.Вставить("ПроцентнаяСтавка",		 "Процентная ставка");
	
	СверяемыеРасчетныеМесяцы = ТаблицаСредневзвешенныхПроцентныхСтавок.Скопировать(Неопределено, "НачалоРасчетногоМесяца, Валюта");
	СверяемыеРасчетныеМесяцы.Свернуть("НачалоРасчетногоМесяца, Валюта");
	
	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("ДатаЗагрузки",			 ЭтотОбъект.ДатаЗагрузки);
	ПараметрыОтчета.Вставить("ВидПроцентныхПоказателей", ВидПроцентныхПоказателей);
	ПараметрыОтчета.Вставить("ГруппаБанков",			 ГруппаБанков);
	ПараметрыОтчета.Вставить("СверяемыеРасчетныеМесяцы", СверяемыеРасчетныеМесяцы);
	
	ДанныеДляСверки = Новый Структура;
	ДанныеДляСверки.Вставить("ЗаголовокОтчета",				СтрШаблон("Изменения средневзвешенных ставок '%1' по группе банков '%2' (%3)", ВидПроцентныхПоказателей, ГруппаБанков, Файл.ИмяФайла));
	ДанныеДляСверки.Вставить("ПредставлениеУчетнойСистемы",	"1C");
	ДанныеДляСверки.Вставить("ПредставлениеВнешнейСистемы",	"Файл");
	ДанныеДляСверки.Вставить("ВыводитьТолькоРасхождения",	Истина);
	ДанныеДляСверки.Вставить("ПараметрыОтчета",				ПараметрыОтчета);
	ДанныеДляСверки.Вставить("ВыводитьПараметры",			Ложь);
	ДанныеДляСверки.Вставить("НаборыДанных",				НаборыДанных);
	ДанныеДляСверки.Вставить("Заголовки",					Заголовки);
	
	// Блокируем от изменения
	
	НачатьТранзакцию();
	
	БлокировкаДанных = Новый БлокировкаДанных();
	ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.СредневзвешенныеПроцентныеСтавки");
	ЭлементБлокировкиДанных.УстановитьЗначение("Вид",			ВидПроцентныхПоказателей);
	ЭлементБлокировкиДанных.УстановитьЗначение("ГруппаБанков",	ГруппаБанков);
	БлокировкаДанных.Заблокировать();
	
	// Выполняем сверку
	
	ОтчетОбИзмененияхПоНабору	= Новый ТабличныйДокумент;
	ЕстьРасхождения				= Ложь;
	
	Изменения = РаботаСОтчетами.ЗаполнитьОтчетОРасхожденияхНаборовДанных(ДанныеДляСверки, ОтчетОбИзмененияхПоНабору, ЕстьРасхождения, Истина, Истина);	
	
	Если ЕстьРасхождения Тогда
		
		Файл.Сохранить = Истина;
		
		// Обновляем записи
		
		Для Каждого ОписаниеИзмененияСтроки Из Изменения Цикл
			
			ОшибкаЗаписи			= Ложь;
			ЗаписьОтсутствуетВФайле	= Ложь;
			
			МенеджерЗаписи = РегистрыСведений.СредневзвешенныеПроцентныеСтавки.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ОписаниеИзмененияСтроки.КлючевыеПоля);
			МенеджерЗаписи.Период = ЭтотОбъект.ДатаЗагрузки;
			
			Для Каждого ОписаниеИзмененияПоля Из ОписаниеИзмененияСтроки.Поля Цикл
				Если ОписаниеИзмененияПоля.ЗначениеВнешнейСистемы = NULL Тогда
					ЗаписьОтсутствуетВФайле = Истина;
					Прервать;
				Иначе
					МенеджерЗаписи[ОписаниеИзмененияПоля.Поле] = ОписаниеИзмененияПоля.ЗначениеВнешнейСистемы;
				КонецЕсли;
			КонецЦикла;
			
			Если ЗаписьОтсутствуетВФайле Тогда
				
				МенеджерЗаписи.Прочитать();
				
				Если МенеджерЗаписи.Выбран() Тогда
					
					// Если в 1С запись того же периода, просто удаляем ее
					
					МенеджерЗаписи.Удалить();
					
				Иначе
					
					// Выключаем старое значение начиная с даты загрузки
					
					МенеджерЗаписи = РегистрыСведений.СредневзвешенныеПроцентныеСтавки.СоздатьМенеджерЗаписи();
					ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ОписаниеИзмененияСтроки.КлючевыеПоля);
					МенеджерЗаписи.Период	 = ЭтотОбъект.ДатаЗагрузки;					
					МенеджерЗаписи.Действует = Ложь;
					МенеджерЗаписи.Записать(Истина);

					ОписаниеЗаписи = РаботаСКоллекциями.СкопироватьСтруктуру(ОписаниеИзмененияСтроки.КлючевыеПоля);
					Для Каждого ОписаниеИзмененияПоля Из ОписаниеИзмененияСтроки.Поля Цикл
						ОписаниеЗаписи.Вставить(ОписаниеИзмененияПоля.Поле, ОписаниеИзмененияПоля.ЗначениеУчетнойСистемы); 
					КонецЦикла;
					
					ТекстОшибки = СтрШаблон(
						"На основании данных файла '%1' запись о средневзвешенных ставках [%2] с %3 прекратила свое действие",
						Файл.ИмяФайла,
						РаботаСоСтрокамиКлиентСервер.ПредставлениеСтруктуры(ОписаниеЗаписи, ", "),
						Формат(ЭтотОбъект.ДатаЗагрузки, "ДФ=dd.MM.yyyy"));
					
					ДобавитьОшибку(ТекстОшибки);
					
				КонецЕсли;
				
			Иначе
				
				МенеджерЗаписи.Действует = Истина; // Из ЦБ РФ могут приходить только действующие записи
				МенеджерЗаписи.Записать(Истина);
				
			КонецЕсли;
			
		КонецЦикла;		
		
		// Выводим изменения в отчет
		
		Если ОтчетОбИзменениях = Неопределено Тогда
			ОтчетОбИзменениях = Новый ТабличныйДокумент;
		КонецЕсли;
		
		ОтчетОбИзменениях.Вывести(ОтчетОбИзмененияхПоНабору);
		
	КонецЕсли;
	
	ЗафиксироватьТранзакцию();
	
	Возврат ЕстьРасхождения;
	
КонецФункции

Функция ЗаполнитьТаблицуСредневзвешенныхПроцентныхСтавокПоВкладам(Файл, ТаблицаСредневзвешенныхПроцентныхСтавок, ВидСредневзвешенныхСтавокНФО, ГруппаБанков)
	
	ОшибкаЧтенияФайла			= Ложь;
	МассивСообщенийПользователю	= ОбщегоНазначения.ОчиститьБуферСообщенийПользователю();
	
	Попытка
		Таблица = Новый ТабличныйДокумент;
		Таблица.Прочитать(Файл.ПолноеИмяФайла, СпособЧтенияЗначенийТабличногоДокумента.Значение, ТипФайлаТабличногоДокумента.XLSX);
	Исключение
		ТекстОшибки = СтрШаблон("Не удалось прочитать загруженный файл со средневзвешенными ставками '%1' по группе банков '%2'.", ВидСредневзвешенныхСтавокНФО, ГруппаБанков);
		ОбщегоНазначения.ОбработатьИсключение(ТекстОшибки, ИнформацияОбОшибке(), ИсточникВызоваКоманды, ОшибкаЧтенияФайла, Ошибки);
	КонецПопытки;
	
	ОбщегоНазначения.ВосстановитьСообщенияПользователю(МассивСообщенийПользователю);
	
	Если ОшибкаЧтенияФайла Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ОшибкиЗаполнения		= Новый Массив;
	ЕстьОшибкиПоискаОбласти	= Ложь;
	
	#Область Заполнение_настроек_шаблона
	
	ИнтервалыШкалыСвернутойШкалы = Новый Массив;
	ИнтервалыШкалыСвернутойШкалы.Добавить(Перечисления.ИнтервалыШкалСредневзвешенныхПроцентныхСтавокПоДепозитам.До1ГодаВключаяДоВостребования);
	ИнтервалыШкалыСвернутойШкалы.Добавить(Перечисления.ИнтервалыШкалСредневзвешенныхПроцентныхСтавокПоДепозитам.До1ГодаКромеДоВостребования);
	ИнтервалыШкалыСвернутойШкалы.Добавить(Перечисления.ИнтервалыШкалСредневзвешенныхПроцентныхСтавокПоДепозитам.Свыше1Года);
	
	ОписаниеОбластей = Новый Структура;
	ОписаниеОбластей.Вставить("ставки_долл_США", Новый Структура("Валюта, Страницы", ОбщегоНазначения.ПолучитьИменованныйОбъект("Валюта_Доллар_США"),		Новый Массив));
	ОписаниеОбластей.Вставить("ставки_евро",	 Новый Структура("Валюта, Страницы", ОбщегоНазначения.ПолучитьИменованныйОбъект("Валюта_ЕВРО"),				Новый Массив));
	ОписаниеОбластей.Вставить("ставки_руб",		 Новый Структура("Валюта, Страницы", ОбщегоНазначения.ПолучитьИменованныйОбъект("Валюта_Российский_рубль"),	Новый Массив));
	
	ОписаниеОбластей.ставки_долл_США.Страницы.Добавить("ставки_долл_США");
	ОписаниеОбластей.ставки_евро.Страницы.Добавить("ставки_евро");
	ОписаниеОбластей.ставки_руб.Страницы.Добавить("ставки_руб");
	ОписаниеОбластей.ставки_руб.Страницы.Добавить("ставки_руб_");
	
	Месяцы = Новый Массив;
	Месяцы.Добавить(""); // индекс 0
	Для Сч = 1 По 12 Цикл
		Месяцы.Добавить(Формат(Дата(2014, Сч, 1), "ДФ=MMMM"));
	КонецЦикла;	
	
	СоответствиеШаблонов = Новый ТаблицаЗначений;
	СоответствиеШаблонов.Колонки.Добавить("ГруппаБанков",	Новый ОписаниеТипов("Строка"));
	СоответствиеШаблонов.Колонки.Добавить("ВидПоказателей",	Новый ОписаниеТипов("Строка"));
	СоответствиеШаблонов.Колонки.Добавить("Шаблон",			Новый ОписаниеТипов("Строка"));
	
	ЗаполнитьЗначенияСвойств(СоответствиеШаблонов.Добавить(), Новый Структура("ГруппаБанков, ВидПоказателей, Шаблон", "ВсеБанкиРФ",			"ПоДепозитамНФО",		"ШаблонВсеБанкиРФПоДепозитамНФО_ФизЛиц"));
	ЗаполнитьЗначенияСвойств(СоответствиеШаблонов.Добавить(), Новый Структура("ГруппаБанков, ВидПоказателей, Шаблон", "ВсеБанкиРФ",			"ПоДепозитамФизЛиц",	"ШаблонВсеБанкиРФПоДепозитамНФО_ФизЛиц"));
	ЗаполнитьЗначенияСвойств(СоответствиеШаблонов.Добавить(), Новый Структура("ГруппаБанков, ВидПоказателей, Шаблон", "Крупнейшие30Банков", "ПоДепозитамНФО",		"ШаблонКрупнейшие30БанковПоДепозитамНФО_ФизЛиц"));
	ЗаполнитьЗначенияСвойств(СоответствиеШаблонов.Добавить(), Новый Структура("ГруппаБанков, ВидПоказателей, Шаблон", "Крупнейшие30Банков", "ПоДепозитамФизЛиц",	"ШаблонКрупнейшие30БанковПоДепозитамНФО_ФизЛиц"));
	ЗаполнитьЗначенияСвойств(СоответствиеШаблонов.Добавить(), Новый Структура("ГруппаБанков, ВидПоказателей, Шаблон", "ВсеБанкиРФ",			"ПоКредитамФизЛиц",		"ШаблонВсеБанкиРФПоКредитамФизЛиц"));
	ЗаполнитьЗначенияСвойств(СоответствиеШаблонов.Добавить(), Новый Структура("ГруппаБанков, ВидПоказателей, Шаблон", "Крупнейшие30Банков", "ПоКредитамФизЛиц",		"ШаблонКрупнейшие30БанковПоКредитамФизЛиц"));
	ЗаполнитьЗначенияСвойств(СоответствиеШаблонов.Добавить(), Новый Структура("ГруппаБанков, ВидПоказателей, Шаблон", "ВсеБанкиРФ",			"ПоКредитамНФО",		"ШаблонВсеБанкиРФПоКредитамНФО_МСП"));
	ЗаполнитьЗначенияСвойств(СоответствиеШаблонов.Добавить(), Новый Структура("ГруппаБанков, ВидПоказателей, Шаблон", "ВсеБанкиРФ",			"ПоКредитамМСП",		"ШаблонВсеБанкиРФПоКредитамНФО_МСП"));
	ЗаполнитьЗначенияСвойств(СоответствиеШаблонов.Добавить(), Новый Структура("ГруппаБанков, ВидПоказателей, Шаблон", "Крупнейшие30Банков", "ПоКредитамНФО",		"ШаблонКрупнейшие30БанковПоКредитамНФО_МСП"));
	ЗаполнитьЗначенияСвойств(СоответствиеШаблонов.Добавить(), Новый Структура("ГруппаБанков, ВидПоказателей, Шаблон", "Крупнейшие30Банков", "ПоКредитамМСП",		"ШаблонКрупнейшие30БанковПоКредитамНФО_МСП"));
	
	#КонецОбласти

	ОтборШаблона = Новый Структура("ГруппаБанков, ВидПоказателей",
		РаботаСМетаданнымиПовтИсп.ПолучитьИдентификаторПеречисления(ГруппаБанков),
		РаботаСМетаданнымиПовтИсп.ПолучитьИдентификаторПеречисления(ВидСредневзвешенныхСтавокНФО));
		
	Шаблон = ПолучитьМакет(СоответствиеШаблонов.НайтиСтроки(ОтборШаблона)[0].Шаблон);
	
	Для Каждого ОписаниеОбласти Из ОписаниеОбластей Цикл
		
		СвойстваОбласти = ОписаниеОбласти.Значение;
		
		#Область Поиск_страницы_соответствующей_шаблону
		
		НайденоНесколькоОбластей	= Ложь;
		СтраницаНайдена				= Ложь;
		ИмяСтраницы					= "";
		
		Для Каждого ВариантИмениСтраницы Из СвойстваОбласти.Страницы Цикл
			Если Таблица.Области.Найти(ВариантИмениСтраницы) <> Неопределено Тогда
				Если СтраницаНайдена Тогда
					НайденоНесколькоОбластей = Истина;
					Прервать;
				Иначе
					ИмяСтраницы		= ВариантИмениСтраницы;
					СтраницаНайдена	= Истина;
				КонецЕсли;
			КонецЕсли;		
		КонецЦикла; 
		
		Если НайденоНесколькоОбластей Тогда
			ОшибкиЗаполнения.Добавить(СтрШаблон("Найдено несколько страниц с валютой '%1'", СвойстваОбласти.Валюта));
			ЕстьОшибкиПоискаОбласти = Истина;
			Продолжить;
		ИначеЕсли Не СтраницаНайдена Тогда
			ОшибкиЗаполнения.Добавить(СтрШаблон("Не найдена страница с валютой '%1'", СвойстваОбласти.Валюта));
			ЕстьОшибкиПоискаОбласти = Истина;
			Продолжить;
		КонецЕсли;		
			
		#КонецОбласти
		
		ОбластьШаблона = Неопределено;
		
		Для Каждого ОбластиШаблона Из Шаблон.Области Цикл
			
			Если ОбластиШаблона.ТипОбласти <> ТипОбластиЯчеекТабличногоДокумента.Строки
				ИЛИ Не СтрНачинаетсяС(ОбластиШаблона.Имя, ОписаниеОбласти.Ключ)
			Тогда
				Продолжить; // Области, заданные строками, соответствуют листам Excel, прочие - нас не интересуют
			КонецЕсли;
			
			ОбластьШаблона			 = Шаблон.ПолучитьОбласть(ОбластиШаблона.Имя);
			ОбластьТаблицы			 = Таблица.ПолучитьОбласть(ИмяСтраницы);
			ФайлСоответствуетШаблону = Истина;
			
			#Область Проверка_соответствия_области_шаблону
			
			#Область Удаление_пустых_строк_в_шапке_страницы
			
			Для НомерСтроки = -10 По -1 Цикл // Обычно шапка в первых 10 строках
				
				СтрокаПустая = Истина;
				
				Для НомерКолонки = 1 По ОбластьТаблицы.ШиринаТаблицы Цикл
					Если Не ПустаяСтрока(ОбластьТаблицы.Область(-НомерСтроки, НомерКолонки, -НомерСтроки, НомерКолонки).Текст) Тогда
						СтрокаПустая = Ложь;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
				Если СтрокаПустая Тогда
					ОбластьТаблицы.УдалитьОбласть(ОбластьТаблицы.Область(-НомерСтроки, , -НомерСтроки), ТипСмещенияТабличногоДокумента.ПоВертикали);
				КонецЕсли;
				
			КонецЦикла;		
			
			#КонецОбласти
			
			#Область Удаление_пустых_столбцов_в_шапке_страницы
			
			МассивУдаляемыхКолонок = Новый Массив;
			
			Для НомерКолонки = -ОбластьТаблицы.ШиринаТаблицы По -2 Цикл // Пустая первая колонка в шапке соответствует шаблону
				
				СтолбецПустой = Истина;
				
				Для НомерСтроки = 1 По ОбластьШаблона.ВысотаТаблицы Цикл
					Если Не ПустаяСтрока(ОбластьТаблицы.Область(НомерСтроки, -НомерКолонки, НомерСтроки, -НомерКолонки).Текст) Тогда
						СтолбецПустой = Ложь;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
				Если СтолбецПустой Тогда
					МассивУдаляемыхКолонок.Добавить(-НомерКолонки);
				КонецЕсли;
				
			КонецЦикла;		
			
			Если МассивУдаляемыхКолонок.Количество() > 0 Тогда
				
				УдалитьФорматСтрокТабличногоДокумента(ОбластьТаблицы);
				
				Для Каждого НомерКолонки Из МассивУдаляемыхКолонок Цикл
					ОбластьТаблицы.УдалитьОбласть(ОбластьТаблицы.Область(, НомерКолонки, , НомерКолонки), ТипСмещенияТабличногоДокумента.ПоГоризонтали);
				КонецЦикла;		
				
			КонецЕсли;
			
			#КонецОбласти
					
			Для НомерСтроки = 1 По ОбластьШаблона.ВысотаТаблицы Цикл
				Для НомерКолонки = 1 По ОбластьШаблона.ШиринаТаблицы Цикл
					Если ФайлСоответствуетШаблону
						И УбратьНеСущественныеСимволы(ОбластьШаблона.Область(НомерСтроки, НомерКолонки, НомерСтроки, НомерКолонки).Текст) 
							<> УбратьНеСущественныеСимволы(ОбластьТаблицы.Область(НомерСтроки, НомерКолонки, НомерСтроки, НомерКолонки).Текст)
					Тогда
						ФайлСоответствуетШаблону = Ложь;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
			
			Если ФайлСоответствуетШаблону Тогда
				Прервать;
			КонецЕсли;
				
			#КонецОбласти	
		
		КонецЦикла;
		
		Если ОбластьШаблона = Неопределено Тогда
			ОшибкиЗаполнения.Добавить(СтрШаблон("Не найден шаблон, соответствующий ключу '%1'", ОписаниеОбласти.Ключ));
			Продолжить;
		ИначеЕсли Не ФайлСоответствуетШаблону Тогда
			ОшибкиЗаполнения.Добавить(СтрШаблон("Страница '%1' не соответствует шаблону '%2'", ИмяСтраницы, ОписаниеОбласти.Ключ));
			Продолжить;
		КонецЕсли;
		
		ОбластьСДанными	= ОбластьШаблона.Области[ОбластиШаблона.Имя + "_" + РаботаСМетаданнымиПовтИсп.ПолучитьИдентификаторПеречисления(ВидСредневзвешенныхСтавокНФО)];
		
		ИнтервалыВКолонках = Новый Соответствие; 
		
		Для НомерКолонки = ОбластьСДанными.Лево По ОбластьСДанными.Право Цикл
			ИдентификаторИнтервала = ОбластьШаблона.Область(ОбластьСДанными.Верх, НомерКолонки).ПараметрРасшифровки;
			ИнтервалыВКолонках.Вставить(НомерКолонки, Перечисления.ИнтервалыШкалСредневзвешенныхПроцентныхСтавокПоДепозитам[ИдентификаторИнтервала]);
		КонецЦикла;
		
		Для НомерСтроки = ОбластьШаблона.ВысотаТаблицы + 1 По ОбластьТаблицы.ВысотаТаблицы Цикл
			
			ПериодСтавок = ОбластьТаблицы.Область(НомерСтроки, 1, НомерСтроки, 1).Текст;
						
			Если СтрокаВДату(ПериодСтавок, Месяцы, ОшибкиЗаполнения) Тогда
				
				Для НомерКолонки = ОбластьСДанными.Лево По ОбластьСДанными.Право Цикл
					
					ПроцентнаяСтавка = ОбластьТаблицы.Область(НомерСтроки, НомерКолонки, НомерСтроки, НомерКолонки).Текст;
					
					НоваяСтрока = ТаблицаСредневзвешенныхПроцентныхСтавок.Добавить();
					НоваяСтрока.Период					= ЭтотОбъект.ДатаЗагрузки;
					НоваяСтрока.НачалоРасчетногоМесяца  = ПериодСтавок;
					НоваяСтрока.Вид						= ВидСредневзвешенныхСтавокНФО;
					НоваяСтрока.ГруппаБанков			= ГруппаБанков;
					НоваяСтрока.ИнтервалШкалы			= ИнтервалыВКолонках[НомерКолонки];
					НоваяСтрока.ВидШкалы				= ?(ИнтервалыШкалыСвернутойШкалы.Найти(НоваяСтрока.ИнтервалШкалы) = Неопределено, 
							                        		Перечисления.ВидыШкалСредневзвешенныхПроцентныхСтавковПоДепозитам.Развернутая,
															Перечисления.ВидыШкалСредневзвешенныхПроцентныхСтавковПоДепозитам.Свернутая);
					НоваяСтрока.Валюта					= СвойстваОбласти.Валюта;
					НоваяСтрока.ПроцентнаяСтавка		= ?(ПроцентнаяСтавка = "-", 0, ПроцентнаяСтавка);
					НоваяСтрока.Действует				= (ПроцентнаяСтавка <> "-");
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
			
	КонецЦикла;
	
	#Область Проверим_отсутствие_пропусков_расчетных_месяцев
	
	Запрос = Новый Запрос;
	
	СистемныеФункции.ПоместитьТаблицуЗначенийВМенеджерВременныхТаблиц(ТаблицаСредневзвешенныхПроцентныхСтавок, "_РасчетныеМесяцы", Запрос, Истина, "НачалоРасчетногоМесяца, Валюта");
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_РасчетныеМесяцы.Валюта КАК Валюта,
		|	ДОБАВИТЬКДАТЕ(_РасчетныеМесяцы.НачалоРасчетногоМесяца, МЕСЯЦ, 1) КАК НачалоРасчетногоМесяца
		|ИЗ
		|	_РасчетныеМесяцы КАК _РасчетныеМесяцы
		|		ЛЕВОЕ СОЕДИНЕНИЕ _РасчетныеМесяцы КАК _РасчетныеМесяцыПосле
		|		ПО (_РасчетныеМесяцы.НачалоРасчетногоМесяца = ДОБАВИТЬКДАТЕ(_РасчетныеМесяцы.НачалоРасчетногоМесяца, МЕСЯЦ, 1))
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			_РасчетныеМесяцы.Валюта КАК Валюта,
		|			МАКСИМУМ(_РасчетныеМесяцы.НачалоРасчетногоМесяца) КАК НачалоРасчетногоМесяца
		|		ИЗ
		|			_РасчетныеМесяцы КАК _РасчетныеМесяцы
		|		
		|		СГРУППИРОВАТЬ ПО
		|			_РасчетныеМесяцы.Валюта) КАК _МаксимальнаяДата
		|		ПО (_МаксимальнаяДата.Валюта = _РасчетныеМесяцы.Валюта)
		|ГДЕ
		|	_РасчетныеМесяцы.НачалоРасчетногоМесяца ЕСТЬ NULL
		|	И _РасчетныеМесяцы.НачалоРасчетногоМесяца <> _МаксимальнаяДата.НачалоРасчетногоМесяца
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СредневзвешенныеПроцентныеСтавки.Валюта,
		|	СредневзвешенныеПроцентныеСтавки.НачалоРасчетногоМесяца
		|ИЗ
		|	РегистрСведений.СредневзвешенныеПроцентныеСтавки.СрезПоследних(
		|			&ДеньДоДатыЗагрузки,
		|			ГруппаБанков = &ГруппаБанков
		|				И Вид = &ВидСтавок) КАК СредневзвешенныеПроцентныеСтавки
		|		ЛЕВОЕ СОЕДИНЕНИЕ _РасчетныеМесяцы КАК _РасчетныеМесяцы
		|		ПО (_РасчетныеМесяцы.НачалоРасчетногоМесяца = СредневзвешенныеПроцентныеСтавки.НачалоРасчетногоМесяца)
		|			И (_РасчетныеМесяцы.Валюта = СредневзвешенныеПроцентныеСтавки.Валюта)
		|ГДЕ
		|	_РасчетныеМесяцы.НачалоРасчетногоМесяца ЕСТЬ NULL
		|
		|УПОРЯДОЧИТЬ ПО
		|	Валюта,
		|	НачалоРасчетногоМесяца
		|ИТОГИ ПО
		|	Валюта
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("ДеньДоДатыЗагрузки", НачалоДня(ЭтотОбъект.ДатаЗагрузки) - 1);
	Запрос.УстановитьПараметр("ВидСтавок",			ВидСредневзвешенныхСтавокНФО);
	Запрос.УстановитьПараметр("ГруппаБанков",		ГруппаБанков);
	
	РезультатЗапросаПропущенныхДат = Запрос.Выполнить();
	
	Если Не РезультатЗапросаПропущенныхДат.Пустой() Тогда
		
		ТекстОшибки = "Отсутствуют данные за следующие расчетные месяцы:";
		
		ВыборкаВалют = РезультатЗапросаПропущенныхДат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаВалют.Следующий() Цикл
			
			ПропущенныеДаты = Новый Массив;

			ВыборкаДат = ВыборкаВалют.Выбрать();
			Пока ВыборкаДат.Следующий() Цикл
				ПропущенныеДаты.Добавить(Формат(ВыборкаДат.НачалоРасчетногоМесяца, "ДФ=dd.MM.yyyy"));
			КонецЦикла;
			
			ТекстОшибки = ТекстОшибки + Символы.ПС + СтрШаблон("- %1: %2", ВыборкаВалют.Валюта, СтрСоединить(ПропущенныеДаты, ", "));

		КонецЦикла;
		
		ОшибкиЗаполнения.Добавить(ТекстОшибки);
		
	КонецЕсли;
	
	#КонецОбласти
	
	Если ОшибкиЗаполнения.Количество() > 0 Тогда
		
		#Область Регистрируем_ошибки
		
		ПредставлениеОшибок = СтрСоединить(ОшибкиЗаполнения, Символы.ПС);
		
		Если ЕстьОшибкиПоискаОбласти Тогда
			
			ОбластиФайла = Новый Массив;
			Для Каждого ОбластьФайла Из Таблица.Области Цикл
				ОбластиФайла.Добавить(ОбластьФайла.Имя);
			КонецЦикла;
			
			ПредставлениеОшибок = "Области файла: " + СтрСоединить(ОбластиФайла, ", ") + Символы.ПС + Символы.ПС + ПредставлениеОшибок;

		КонецЕсли;	
		
		ТекстОшибки = СтрШаблон(
			"Ошибка чтения данных из файла со средневзвешенными ставками '%1' по группе банков '%2':
			|%3
			|
			|%4
			|
			|Файл сохранён в Externals", ВидСредневзвешенныхСтавокНФО, ГруппаБанков, Файл.ПолноеИмяФайла, ПредставлениеОшибок);
		
		ДобавитьОшибку(ТекстОшибки);
		
		Файл.Сохранить = Истина;
		
		#КонецОбласти
		
	КонецЕсли;
	
	Возврат (ОшибкиЗаполнения.Количество() = 0);
	
КонецФункции

#Область Вспомогательные_функции

Функция СкачатьФайл(ТаблицаФайлов, ВидПроцентныхПоказателей, ГруппаБанков)
	
	ОшибкаСкачиванияФайла	= Ложь;
	
	ИмяФайла				= Неопределено;
	ИдентификаторИсточника	= Неопределено;
	ВремяЗагрузки			= Неопределено;
	
	#Область Определение_имени_файла_и_ИД_источника
	
	Если ВидПроцентныхПоказателей = Перечисления.ВидыСредневзвешенныхСтавок.ПоДепозитамНФО
		ИЛИ ВидПроцентныхПоказателей = Перечисления.ВидыСредневзвешенныхСтавок.ПоДепозитамФизЛиц
	Тогда

		Если ГруппаБанков = Перечисления.ГруппыБанковДляПолученияРыночнойПроцентнойСтавки.ВсеБанкиРФ Тогда
			ИмяФайла				= "deposits.xlsx";
			ИдентификаторИсточника	= 11;
		ИначеЕсли ГруппаБанков = Перечисления.ГруппыБанковДляПолученияРыночнойПроцентнойСтавки.Крупнейшие30Банков Тогда
			ИмяФайла				= "deposits_30.xlsx";
			ИдентификаторИсточника	= 36;
		КонецЕсли;
		
	ИначеЕсли ВидПроцентныхПоказателей = Перечисления.ВидыСредневзвешенныхСтавок.ПоКредитамНФО
		ИЛИ ВидПроцентныхПоказателей = Перечисления.ВидыСредневзвешенныхСтавок.ПоКредитамМСП
	Тогда
		  
		Если ГруппаБанков = Перечисления.ГруппыБанковДляПолученияРыночнойПроцентнойСтавки.ВсеБанкиРФ Тогда
			ИмяФайла				= "loans_nonfin.xlsx";
			ИдентификаторИсточника	= 37;
		ИначеЕсли ГруппаБанков = Перечисления.ГруппыБанковДляПолученияРыночнойПроцентнойСтавки.Крупнейшие30Банков Тогда
			ИмяФайла				= "loans_nonfin_30.xlsx";
			ИдентификаторИсточника	= 38;
		КонецЕсли;
		
	ИначеЕсли ВидПроцентныхПоказателей = Перечисления.ВидыСредневзвешенныхСтавок.ПоКредитамФизЛиц Тогда	
		
		Если ГруппаБанков = Перечисления.ГруппыБанковДляПолученияРыночнойПроцентнойСтавки.ВсеБанкиРФ Тогда
			ИмяФайла				= "loans_ind_new.xlsx";
			ИдентификаторИсточника	= 39;
		ИначеЕсли ГруппаБанков = Перечисления.ГруппыБанковДляПолученияРыночнойПроцентнойСтавки.Крупнейшие30Банков Тогда
			ИмяФайла				= "loans_ind_30.xlsx";
			ИдентификаторИсточника	= 40;
		КонецЕсли;
	
	КонецЕсли;
	
	#КонецОбласти
	
	Если ИмяФайла = Неопределено Тогда
		
		ТекстИсключения = СтрШаблон("Не удалось определить адрес файла со средневзвешенными ставками '%1' по группе банков '%2'", ВидПроцентныхПоказателей, ГруппаБанков);
		ДобавитьОшибку(ТекстИсключения, Исключения);
		ОшибкаСкачиванияФайла = Истина;
		
	Иначе
		
		АдресИсточника = "https://www.cbr.ru/vfs/statistics/pdko/int_rat/" + ИмяФайла;
		СкачанныйФайл  = ТаблицаФайлов.Найти(АдресИсточника, "АдресИсточника");
		
		Если СкачанныйФайл = Неопределено Тогда
			
			КаталогВременныхФайлов	= ?(ПараметрыСеанса.ЭтоРабочаяИнформационнаяБаза, ОбщегоНазначенияКлиентСервер.ПолучитьКаталогВременныхФайлов(), КаталогВременныхФайлов());
			ПолноеИмяФайла			= РаботаСФайламиКлиентСервер.ПолучитьПолноеИмяФайла(КаталогВременныхФайлов, ИмяФайла);
			
			Попытка
			    УдалитьФайлы(ПолноеИмяФайла);
			Исключение
			КонецПопытки;
			
			МассивСообщенийПользователю = ОбщегоНазначения.ОчиститьБуферСообщенийПользователю();
			
			Попытка
				КопироватьФайл(АдресИсточника, ПолноеИмяФайла); 
			Исключение
				ТекстОшибки = СтрШаблон("Не удалось загрузить файл со средневзвешенными ставками '%1' по группе банков '%2'.", ВидПроцентныхПоказателей, ГруппаБанков);
				ОбщегоНазначения.ОбработатьИсключение(ТекстОшибки, ИнформацияОбОшибке(), ИсточникВызоваКоманды, ОшибкаСкачиванияФайла, Ошибки);
			КонецПопытки;
			
			ОбщегоНазначения.ВосстановитьСообщенияПользователю(МассивСообщенийПользователю);
			
			Если Не ОшибкаСкачиванияФайла Тогда
				
				ДвоичныеДанные = Новый ДвоичныеДанные(ПолноеИмяФайла);
				
				СкачанныйФайл = ТаблицаФайлов.Добавить();
				СкачанныйФайл.ИмяФайла		 = ИмяФайла;
				СкачанныйФайл.ПолноеИмяФайла = ПолноеИмяФайла;
				СкачанныйФайл.АдресИсточника = АдресИсточника;
				СкачанныйФайл.Источник		 = ИдентификаторИсточника;
				СкачанныйФайл.ДвоичныеДанные = ДвоичныеДанные;
				СкачанныйФайл.ХешСумма		 = УниверсальныеМеханизмы.ПолучитьКонтрольнуюСуммуДвоичныхДанных(ДвоичныеДанные, ХешФункция.SHA256);
				СкачанныйФайл.ВремяЗагрузки	 = ВремяЗагрузки;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ?(ОшибкаСкачиванияФайла, Неопределено, СкачанныйФайл);
	
КонецФункции

Функция СтрокаВДату(Значение, Месяцы, МассивОшибок)
	
	МассивЧастейДаты = СтрРазделить(Значение, " ");
	Если МассивЧастейДаты.Количество() <> 2 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Месяцы.Найти(МассивЧастейДаты[0]) = Неопределено Тогда
		ТекстОшибки = "Не удалось распознать дату: " + Значение;
		Если МассивОшибок.Найти(ТекстОшибки) = Неопределено Тогда
			МассивОшибок.Добавить(ТекстОшибки);
		КонецЕсли;
		Возврат Ложь;
	КонецЕсли;
	
	Значение = Дата(МассивЧастейДаты[1], Месяцы.Найти(МассивЧастейДаты[0]), 1);
	
	Возврат Истина;
	
КонецФункции

Функция УбратьНеСущественныеСимволы(Знач ВходящаяСтрока)
	
	ВходящаяСтрока = СтрЗаменить(ВходящаяСтрока, "*", "");
	ВходящаяСтрока = СтрЗаменить(ВходящаяСтрока, " ", "");
	ВходящаяСтрока = СтрЗаменить(ВходящаяСтрока, Символы.НПП, "");

	Возврат ВходящаяСтрока;
	
КонецФункции

Процедура УдалитьФорматСтрокТабличногоДокумента(ТабличныйДокумент)
	
	// Попытаемся установить у всех колонок одинаковую ширину
	// в данном случае у всех строк Табличного документа станет собственный но одинаковый 
	// формат
	ТабличныйДокумент.Область().СоздатьформатСтрок();
	// Запоминаем высоту и ширину области с данными, что бы потом удалить ненужную область
	ВысотаТаблицы  = ТабличныйДокумент.ВысотаТаблицы;
	ШиринаТаблицы  = ТабличныйДокумент.ШиринаТаблицы;
	// Здесь нужно взять именно область типа "прямоугольник", иначе собственные форматы строк скопируются
	// больше всего и было потрачено времени на поиск этой особенности
	ОбластьТД = ТабличныйДокумент.Область(1,1,ВысотаТаблицы,ШиринаТаблицы);
	// Вставляем нашу область в область табличного документа без собственного формата
	// ширины колонок при этом возьмуться из общего табличного документа
	ТабличныйДокумент.ВставитьОбласть(ОбластьТД,ТабличныйДокумент.Область(ВысотаТаблицы+1,1));
	// удаляем изначальную область. Здесь уже обязательно нужно удалять область типа "строки"
	ТабличныйДокумент.УдалитьОбласть(ТабличныйДокумент.Область(1,,ВысотаТаблицы),ТипСмещенияТабличногоДокумента.ПоВертикали);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область Импорт_индексов_потребительских_цен

Процедура ИмпортИндексовПотребительскихЦен() Экспорт
	
	СессияСбораСтатистики = ЗарегистрироватьНачалоСессии("ИмпортИндексовПотребительскихЦен");
	
	#Область Выгрузка_из_Externals
	
	СтрокаСоединения	= РаботаСВнешнимиСистемами.СтрокаСоединенияСExternals();
	ТекстЗапроса		= "
		|SELECT Files.[Publication_Date]
		|      ,Inflation_Rate.[Date]
		|      ,Inflation_Rate.[Inflation_Rate_To_Previous_Month]
		|      ,Inflation_Rate.[Inflation_Rate_To_December_Last_Year]
		|      ,Inflation_Rate.[Inflation_Rate_To_Same_Month_Year]
		|  FROM [Externals].[dbo].[Inflation_Rate]  Inflation_Rate
		|	LEFT JOIN [Externals].[dbo].[Files]  Files
		|		ON Inflation_Rate.File_Id = Files.Id";
	
	ТипыКолонок = Новый Структура;
	ТипыКолонок.Вставить("Publication_Date",						Новый ОписаниеТипов("Дата",,,, Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	ТипыКолонок.Вставить("Date",									Новый ОписаниеТипов("Дата",,,, Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	ТипыКолонок.Вставить("Inflation_Rate_To_Previous_Month",		Метаданные.РегистрыСведений.ПроцентныеПоказатели.Ресурсы.ЗначениеПоказателя.Тип);
	ТипыКолонок.Вставить("Inflation_Rate_To_December_Last_Year",	Метаданные.РегистрыСведений.ПроцентныеПоказатели.Ресурсы.ЗначениеПоказателя.Тип);
	ТипыКолонок.Вставить("Inflation_Rate_To_Same_Month_Year",		Метаданные.РегистрыСведений.ПроцентныеПоказатели.Ресурсы.ЗначениеПоказателя.Тип);
	
	#КонецОбласти
	
	ИПЦ = РаботаСВнешнимиСистемами.ADODBC_ПолучитьТаблицуДанныхССервера(СтрокаСоединения, ТекстЗапроса, ТипыКолонок);
	
	Если ИПЦ = Неопределено Тогда
		
		ДобавитьОшибку("Нет данных для загрузки индексов потребительских цен.");
		
	Иначе
		
		#Область Загрузка_в_1С
		
		ТаблицаПроцентныхПоказателей = ПолучитьСтруктуруРегистра("ПроцентныеПоказатели");	
		
		Если НачалоДня(ТекущаяДата()) > Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, НачалоМесяца(ТекущаяДата()), 7) Тогда // в 7ой рабочий день месяца ИЦБ обязан быть, на 8ой если их нет - генерим ошибку
			ДатаПроверкиИЦП = НачалоДня(КонецМесяца(ДобавитьМесяц(ТекущаяДата(), -1)));
		Иначе
			ДатаПроверкиИЦП = НачалоДня(КонецМесяца(ДобавитьМесяц(ТекущаяДата(), -2)));
		КонецЕсли;
		
		БылоЗначениеЗаДатуПроверки = Ложь;
		
		Для каждого СтрокаИПЦ Из ИПЦ Цикл
			
			ДанныеЗаписи = Новый Структура("Период, Показатель, Источник, ДатаЗначения, ЗначениеПоказателя", 
											СтрокаИПЦ.Publication_Date,
											,
											ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_Росстат"),
											СтрокаИПЦ.Date,
											0);
											
			ДанныеЗаписи.Показатель = Перечисления.ВидыПроцентныхПоказателей.ИПЦкКонцуПредыдущегоМесяца;
			ДанныеЗаписи.ЗначениеПоказателя = СтрокаИПЦ.Inflation_Rate_To_Previous_Month;
			ЗаполнитьЗначенияСвойств(ТаблицаПроцентныхПоказателей.Добавить(), ДанныеЗаписи); 
			
			ДанныеЗаписи.Показатель = Перечисления.ВидыПроцентныхПоказателей.ИПЦкДекабрюПредыдущегоГода;
			ДанныеЗаписи.ЗначениеПоказателя = СтрокаИПЦ.Inflation_Rate_To_December_Last_Year;
			ЗаполнитьЗначенияСвойств(ТаблицаПроцентныхПоказателей.Добавить(), ДанныеЗаписи); 
			
			ДанныеЗаписи.Показатель = Перечисления.ВидыПроцентныхПоказателей.ИПЦкСоответствующемуМесяцуПредыдущегоГода;
			ДанныеЗаписи.ЗначениеПоказателя = СтрокаИПЦ.Inflation_Rate_To_Same_Month_Year;
			ЗаполнитьЗначенияСвойств(ТаблицаПроцентныхПоказателей.Добавить(), ДанныеЗаписи); 
			
			Если ДанныеЗаписи.ДатаЗначения = ДатаПроверкиИЦП Тогда
				БылоЗначениеЗаДатуПроверки = Истина;
			КонецЕсли;
			
		КонецЦикла;
		
		Если НЕ БылоЗначениеЗаДатуПроверки Тогда
			ДобавитьОшибку("До сих пор нет ИПЦ за " + Строка(ДатаПроверкиИЦП));
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ТаблицаПроцентныхПоказателей.Период КАК Период,
			|	ТаблицаПроцентныхПоказателей.Показатель КАК Показатель,
			|	ТаблицаПроцентныхПоказателей.Источник КАК Источник,
			|	ТаблицаПроцентныхПоказателей.ДатаЗначения КАК ДатаЗначения,
			|	ТаблицаПроцентныхПоказателей.ЗначениеПоказателя КАК ЗначениеПоказателя,
			|	ЛОЖЬ КАК Прогноз
			|ПОМЕСТИТЬ _ТаблицаПроцентныхПоказателей
			|ИЗ
			|	&ТаблицаПроцентныхПоказателей КАК ТаблицаПроцентныхПоказателей
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ИСТИНА КАК Активность,
			|	_ТаблицаПроцентныхПоказателей.Период КАК Период,
			|	_ТаблицаПроцентныхПоказателей.Показатель КАК Показатель,
			|	_ТаблицаПроцентныхПоказателей.Прогноз КАК Прогноз,
			|	_ТаблицаПроцентныхПоказателей.Источник КАК Источник,
			|	_ТаблицаПроцентныхПоказателей.ДатаЗначения КАК ДатаЗначения,
			|	_ТаблицаПроцентныхПоказателей.ЗначениеПоказателя КАК ЗначениеПоказателя
			|ИЗ
			|	_ТаблицаПроцентныхПоказателей КАК _ТаблицаПроцентныхПоказателей
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПроцентныеПоказатели КАК ПроцентныеПоказатели
			|		ПО (ПроцентныеПоказатели.Период = _ТаблицаПроцентныхПоказателей.Период)
			|			И (ПроцентныеПоказатели.ДатаЗначения = _ТаблицаПроцентныхПоказателей.ДатаЗначения)
			|			И (ПроцентныеПоказатели.Прогноз = _ТаблицаПроцентныхПоказателей.Прогноз)
			|			И (ПроцентныеПоказатели.Показатель = _ТаблицаПроцентныхПоказателей.Показатель)
			|			И (ПроцентныеПоказатели.Источник = _ТаблицаПроцентныхПоказателей.Источник)
			|ГДЕ
			|	(ПроцентныеПоказатели.ЗначениеПоказателя ЕСТЬ NULL
			|			ИЛИ _ТаблицаПроцентныхПоказателей.ЗначениеПоказателя <> ПроцентныеПоказатели.ЗначениеПоказателя)";
		
		Запрос.УстановитьПараметр("ТаблицаПроцентныхПоказателей", ТаблицаПроцентныхПоказателей);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			МенеджерЗаписи = РегистрыСведений.ПроцентныеПоказатели.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Выборка);
			МенеджерЗаписи.Записать(Истина);
		КонецЦикла;		
		
		#КонецОбласти
		
	КонецЕсли;
	
	ЗарегистрироватьОшибки();
	
	ЗарегистрироватьОкончаниеСессии(СессияСбораСтатистики);
	
КонецПроцедуры
	
#КонецОбласти

#Область Импорт_прогнозных_значений_от_НИУ_ВШЭ

Процедура ИмпортПрогнозныхЗначенийОтНИУВШЭ() Экспорт
	
	СессияСбораСтатистики = ЗарегистрироватьНачалоСессии("ИмпортПрогнозныхЗначенийОтНИУВШЭ");
	
	#Область Выгрузка_из_Externals
	
	ЗагружаемыеПоказатели = Новый Соответствие;
	ЗагружаемыеПоказатели.Вставить("3", Перечисления.ВидыПроцентныхПоказателей.КлючеваяСтавкаЦБРФ);
	ЗагружаемыеПоказатели.Вставить("4", Перечисления.ВидыПроцентныхПоказателей.ИПЦкДекабрюПредыдущегоГода);
	
	ИдентификаторыПоказателей = Новый Массив;
	Для каждого Показатель Из ЗагружаемыеПоказатели Цикл
		ИдентификаторыПоказателей.Добавить(Показатель.Ключ);
	КонецЦикла; 
	
	СтрокаСоединения = РаботаСВнешнимиСистемами.СтрокаСоединенияСExternals();
	ТекстЗапроса	 = 
		"SELECT Forecast_HSE.[Publication_Date]
		|      ,Forecast_HSE.[Forecast_Id]
		|      ,Forecast_HSE.[Year]
		|      ,Forecast_HSE.[Value]
		|  FROM [Externals].[dbo].[Forecast_HSE] Forecast_HSE
		|	WHERE Forecast_Id IN (&ИдентификаторыПоказателей)";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИдентификаторыПоказателей", СтрСоединить(ИдентификаторыПоказателей, ", "));
	
	ТипыКолонок = Новый Структура;
	ТипыКолонок.Вставить("Publication_Date",	Новый ОписаниеТипов("Дата",,,, Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	ТипыКолонок.Вставить("Forecast_Id",			Новый ОписаниеТипов("Строка"));
	ТипыКолонок.Вставить("Year",				Новый ОписаниеТипов("Число",,,, Новый КвалификаторыЧисла(4, 0, ДопустимыйЗнак.Неотрицательный)));
	ТипыКолонок.Вставить("Value",				Метаданные.РегистрыСведений.ПроцентныеПоказатели.Ресурсы.ЗначениеПоказателя.Тип);
	
	#КонецОбласти
	
	ВнешняяТаблицаПрознозныхЗначений = РаботаСВнешнимиСистемами.ADODBC_ПолучитьТаблицуДанныхССервера(СтрокаСоединения, ТекстЗапроса, ТипыКолонок);
	
	Если ВнешняяТаблицаПрознозныхЗначений = Неопределено Тогда
		
		ДобавитьОшибку("Нет данных для загрузки прогнозных значений от НИУ ВШЭ.");
		
	Иначе
		
		#Область Загрузка_в_1С
		
		ИсточникПрогноза			 = ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_ВШЭ");
		ТаблицаПроцентныхПоказателей = ПолучитьСтруктуруРегистра("ПроцентныеПоказатели");	
		
		// даты проверок:
		// 	после 15 ноября и до конца месяца
		//	после 15 августа и до конца месяца
		//	после 15 мая и до конца месяца
		//	после 15 февраля и до конца месяца
		
		Месяцы = Новый Соответствие();
		Месяцы.Вставить(2, "февраль");
		Месяцы.Вставить(5, "май");
		Месяцы.Вставить(8, "август");
		Месяцы.Вставить(11, "ноябрь");

		ТД	= ТекущаяДата();
		Мес = Месяц(ТД);
		
		НужноПроверять = Месяцы[Мес] <> Неопределено И День(ТД) > 14;
		
		БылоЗначениеЗаЭтотМесяц = Ложь;
		Для каждого СтрокаВнешнейТаблицы Из ВнешняяТаблицаПрознозныхЗначений Цикл
			
			СтрокаТПП = ТаблицаПроцентныхПоказателей.Добавить();
			СтрокаТПП.Период				= СтрокаВнешнейТаблицы.Publication_Date; 
			СтрокаТПП.Показатель			= ЗагружаемыеПоказатели[СтрокаВнешнейТаблицы.Forecast_Id];
			СтрокаТПП.Источник				= ИсточникПрогноза;
			СтрокаТПП.ДатаЗначения			= Дата(СтрокаВнешнейТаблицы.Year, 12, 31);
			СтрокаТПП.ЗначениеПоказателя	= СтрокаВнешнейТаблицы.Value;
			
			Если НачалоМесяца(СтрокаТПП.Период) = НачалоМесяца(ТД) Тогда
				БылоЗначениеЗаЭтотМесяц = Истина;
			КонецЕсли;
			
		КонецЦикла;
		
		Если НужноПроверять И НЕ БылоЗначениеЗаЭтотМесяц Тогда
			ДобавитьОшибку("До сих пор нет прогнозных значений от НИУ ВШЭ за " + Месяцы[Мес]);
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ТаблицаПроцентныхПоказателей.Период КАК Период,
			|	ТаблицаПроцентныхПоказателей.Показатель КАК Показатель,
			|	ТаблицаПроцентныхПоказателей.Источник КАК Источник,
			|	ТаблицаПроцентныхПоказателей.ДатаЗначения КАК ДатаЗначения,
			|	ТаблицаПроцентныхПоказателей.ЗначениеПоказателя КАК ЗначениеПоказателя,
			|	ИСТИНА КАК Прогноз
			|ПОМЕСТИТЬ _ТаблицаПроцентныхПоказателей
			|ИЗ
			|	&ТаблицаПроцентныхПоказателей КАК ТаблицаПроцентныхПоказателей
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ИСТИНА КАК Активность,
			|	_ТаблицаПроцентныхПоказателей.Период КАК Период,
			|	_ТаблицаПроцентныхПоказателей.Показатель КАК Показатель,
			|	_ТаблицаПроцентныхПоказателей.Прогноз КАК Прогноз,
			|	_ТаблицаПроцентныхПоказателей.Источник КАК Источник,
			|	_ТаблицаПроцентныхПоказателей.ДатаЗначения КАК ДатаЗначения,
			|	_ТаблицаПроцентныхПоказателей.ЗначениеПоказателя КАК ЗначениеПоказателя
			|ИЗ
			|	_ТаблицаПроцентныхПоказателей КАК _ТаблицаПроцентныхПоказателей
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПроцентныеПоказатели КАК ПроцентныеПоказатели
			|		ПО (ПроцентныеПоказатели.Период = _ТаблицаПроцентныхПоказателей.Период)
			|			И (ПроцентныеПоказатели.ДатаЗначения = _ТаблицаПроцентныхПоказателей.ДатаЗначения)
			|			И (ПроцентныеПоказатели.Прогноз = _ТаблицаПроцентныхПоказателей.Прогноз)
			|			И (ПроцентныеПоказатели.Показатель = _ТаблицаПроцентныхПоказателей.Показатель)
			|			И (ПроцентныеПоказатели.Источник = _ТаблицаПроцентныхПоказателей.Источник)
			|ГДЕ
			|	(ПроцентныеПоказатели.ЗначениеПоказателя ЕСТЬ NULL
			|			ИЛИ _ТаблицаПроцентныхПоказателей.ЗначениеПоказателя <> ПроцентныеПоказатели.ЗначениеПоказателя)";
		
		Запрос.УстановитьПараметр("ТаблицаПроцентныхПоказателей", ТаблицаПроцентныхПоказателей);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			МенеджерЗаписи = РегистрыСведений.ПроцентныеПоказатели.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Выборка);
			МенеджерЗаписи.Записать(Истина);
		КонецЦикла;		
		
		#КонецОбласти
		
	КонецЕсли;
	
	ЗарегистрироватьОшибки();
	
	ЗарегистрироватьОкончаниеСессии(СессияСбораСтатистики);
	
КонецПроцедуры
	
#КонецОбласти

#Область Служебные_процедуры

Функция ПолучитьСтруктуруРегистра(ИмяРегистра)
	
	Запрос = Новый Запрос;
	Запрос.Текст = СтрШаблон(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 0
		|	*
		|ИЗ
		|	РегистрСведений.%1", ИмяРегистра);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ЗарегистрироватьНачалоСессии(ИмяПроцедуры)
	
	ПараметрыСтатистики	= РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект);
	Механизм			= ЭтотОбъект.Метаданные().ПолноеИмя() + "." + ИмяПроцедуры;
	СессияСтатистики	= РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(Механизм, ПараметрыСтатистики.Хранилище, ПараметрыСтатистики.Описание);
	
	Возврат Новый Структура("Механизм, Сессия, СтатистикаВыполнения", Механизм, СессияСтатистики, Новый Массив);
	
КонецФункции

Процедура ЗарегистрироватьОкончаниеСессии(СессияСбораСтатистики)
	
	ДополнительныеПараметрыСтатистики = Новый Структура;
	
	// Ошибки и исключения
	
	ВсеОшибки = Новый Массив;
	
	РаботаСКоллекциями.ДополнитьМассив(ВсеОшибки, Ошибки);
	РаботаСКоллекциями.ДополнитьМассив(ВсеОшибки, Исключения);
	
	Если ВсеОшибки.Количество() > 0 Тогда
		ДополнительныеПараметрыСтатистики.Вставить("Ошибки", Символы.ПС + СтрСоединить(ВсеОшибки, Символы.ПС + Символы.ПС));
	КонецЕсли;	
	
	// Статистика выполнения процедур
	
	Если СессияСбораСтатистики.СтатистикаВыполнения.Количество() > 0 Тогда
		ДополнительныеПараметрыСтатистики.Вставить("СтатистикаВыполнения", Символы.ПС + "- " + СтрСоединить(СессияСбораСтатистики.СтатистикаВыполнения, Символы.ПС + "- "));
	КонецЕсли;
	
	Если ДополнительныеПараметрыСтатистики.Количество() = 0 Тогда
		ДополнительныеПараметрыСтатистики = Неопределено;
	КонецЕсли;
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(СессияСбораСтатистики.Механизм, СессияСбораСтатистики.Сессия, , ДополнительныеПараметрыСтатистики);
	
КонецПроцедуры

Процедура ДобавитьОшибку(ТекстОшибки, МассивОшибок = Неопределено)
	
	КоллекцияОшибок = ?(МассивОшибок = Неопределено, Ошибки, МассивОшибок);
	
	Если КоллекцияОшибок.Найти(ТекстОшибки) = Неопределено Тогда
		
		КоллекцияОшибок.Добавить(ТекстОшибки);
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗарегистрироватьОшибки()
	
	Если Ошибки.Количество() > 0 И ИсточникВызоваКоманды <> Неопределено Тогда
		РаботаСРегламентнымиЗаданиями.ЗарегистрироватьОшибку(Ошибки, ИсточникВызоваКоманды);
	КонецЕсли;
	
	Если Исключения.Количество() > 0 Тогда
		ОбщегоНазначения.ЗарегистрироватьИсключения(Исключения, ?(ИсточникВызоваКоманды = Неопределено, ЭтотОбъект.Метаданные().ПолноеИмя(), ИсточникВызоваКоманды));
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

Ошибки		= Новый Массив;
Исключения	= Новый Массив;
